week4/week4.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Week 4 Review : Group 07</title>
<!-- 2014-05-07 Wed 16:34 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Sam Beveridge, Calvin Lam, Jared Smith" />
<link rel="stylesheet" type="text/css" href="css/week4-style.css" />
<link href='http://fonts.googleapis.com/css?family=Source+Sans+Pro' rel='stylesheet' type='text/css'/>
</head>
<body>
<div id="content">
<h1 class="title">Week 4 Review : Group 07</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Our Home Page</a></li>
<li><a href="#sec-2">Github Source Page</a></li>
<li><a href="#sec-3">Team Members</a></li>
<li><a href="#sec-4">Sam Beveridge: Backend Designer</a>
<ul>
<li><a href="#sec-4-1">Login and Shopping Cart Managment</a></li>
</ul>
</li>
<li><a href="#sec-5">Calvin Lam: UX (User Experience) Designer</a>
<ul>
<li><a href="#sec-5-1">Items to Cart</a></li>
</ul>
</li>
<li><a href="#sec-6">Jared Smith: Frontend Designer</a>
<ul>
<li><a href="#sec-6-1">Gallery Generator</a></li>
</ul>
</li>
<li><a href="#sec-7">Project Status</a></li>
<li><a href="#sec-8">Links</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><a href="../index.html">Our Home Page</a></h2>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><a href="https:github.com/jrods/comp199">Github Source Page</a></h2>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Team Members</h2>
<div class="outline-text-2" id="text-3">
<p class="verse">
Sam Beveridge<br  />
Calvin Lam<br  />
Jared Smith<br  />
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Sam Beveridge: Backend Designer</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">Login and Shopping Cart Managment</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>popup modal for login + registration
</li>
<li>cart page with removal buttons and semi-working calculations
</li>
</ul>

<p>
Could not save the value, but there is a working test file that is able to save the values and can add, remove, and get the total of the cart. We need to successfully implement this setup into our gallery page. We are able to get the price and add up a cart total manually in the code, but we cannot access the totals by pressing the buttons we have made yet. For next week I plan to get the add buttons and the remove buttons as well. We will also be able to display it in a nice format on our page.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Calvin Lam: UX (User Experience) Designer</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">Items to Cart</h3>
<div class="outline-text-3" id="text-5-1">
<p>
In this week I attemted to create a shopping cart and a add to cart button. First I made a function to call the information such as price and album. Than i would post the imformation iinto the shopping cart. I ran into many problems such as the function not retriving infomtion. And the imformation not displaying the price in the cart. 
</p>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Jared Smith: Frontend Designer</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1">Gallery Generator</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>This week I was responsible for getting our content to look pretty.
</li>
<li>Most of my time was taken to creating a layout for the gallery
</li>
<li>All scripted in PHP and styled with CSS
</li>
</ul>
<p>
One problem I had to overcome is figuring out a 'good' way to generate an <b>album object</b>. The div block was my friend to making sure every album object could be positioned were I wanted them to. I then had another problem, which was to figure out how to create multiple album objects within a space, each being unique. I ended up using an unorded list, then putting album objects in list blocks to easily display album objects in an in-line formation using some fancy css. So far, my script generates everything that comes in from a database query. In the future, this needs to be limited to about 10 album objects. In turn, a page functionality will be added to get the next or previous 10 and display those results.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Project Status</h2>
<div class="outline-text-2" id="text-7">
<p>
This week we were able to get a basic shoppingCart and galleryGenerate scripts written and in minimum working condition. The main roadblock that we couldn't finish on time was able to add items to the shoppingCart class. Currently, once we finished the shopping cart, the login/registration is mostly complete and will just need some finishing touches.
</p>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">Links</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li><a href="../project.html">Main Project Outline</a>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Sam Beveridge, Calvin Lam, Jared Smith</p>
<p class="date">Created: 2014-05-07 Wed 16:34</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5h)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
